armandioan/Licenta2022/Cod_sursă_ESP8266.cpp

#include <ESP8266WiFi.h> /////////uC+TIME
#include <ESP8266HTTPClient.h>  //AP
#include <ESP8266WebServer.h>   //AP
#include <EEPROM.h>             //AP
#include <NTPClient.h>          //TIME
#include <WiFiUdp.h>
//////////////
const char* PAROLA_MONTAJ = "2022";                        //PAROLA AUTORIZARE DISPOZITIVE
const uint8_t NR_MAX_DISP = 5;
String webpage      = "about:blank";                       //Adresa refresh
String webpage_router  = "http://rotaru.onthewifi.com/";   //Adresa router
//String webpage_router = "http://192.168.0.59/";          //Adresa router

String hotspot_page = "http://192.168.43.43/";  //Adresa hotspot
String ap           = "http://192.168.4.1/";    //Adresa AP
WiFiServer server(80);                          //80 uC
ESP8266WebServer server1(80);                   //AP
WiFiUDP ntpUDP;                                 //TIME
NTPClient timeClient(ntpUDP);                   //TIME
//////////////
unsigned long currentTime = 0, previousTime = 0, Last_TIME = 0, Check_TIME = 60000, timeoutTime = 5000;
String signatures[NR_MAX_DISP];
uint8_t rooms[4], Mod_Incalzire = 0, nrdev = 0;
String name_rooms[] = { "Toate camerele", "1_DORMITOR", "2_BIROU", "3_BUC&#258;T&#258;RIE" }; // "BUCATARIE"
String s_temp_rooms[] = { "", "10.1", "10.2", "10.3" };
String s_set_temp_rooms[] = { "0.00", "17.0", "17.0", "17.0" };
String temps[] = { "17.0","17.5","18.0","18.5","19.0","19.5","20.0","20.5","21.0","21.5","22.0","22.5","23.0","23.5","24.0","24.5","25.0","25.5","26.0", "26.5", "27.0", "40.0" };
String h_rooms[] = { "", "01", "02", "03" };
uint8_t window_rooms[] = { 0,0,0,0 };
uint8_t alarm_rooms[] = { 0,0,0,0 };
uint8_t heat_rooms[] = { 0, 0, 0, 0 };
String  header = "", currentLine = "", signature = "", fromQFP = "", iii = "", oraStart = "22", oraStop = "05", minStart = "30", minStop = "50";
bool send_temp = false, newd = true, firstline = true, cookie = false, global_temp = true, Mod_Noapte = false, Status_Mod_Noapte = false;
String content, esid = "", epass = "";
uint8_t emobile = 0;

class Router {
private:
    const char* ssid = "ssid";
    const char* password = "pass";
    IPAddress* ip;
    IPAddress* gateway;//
    IPAddress* subnet;//
    IPAddress* dns1;
    bool isMobile = false;
public:
    Router() {}
    Router(const char* _ssid, const char* _password, IPAddress* _ip, IPAddress* _gateway, IPAddress* _subnet, IPAddress* _dns1, bool _isMobile) {
        ssid = _ssid;    password = _password;      ip = _ip;        gateway = _gateway;     subnet = _subnet;    dns1 = _dns1, isMobile = _isMobile;
    }
    bool gogogo() {
        WiFi.config(*ip, *gateway, *subnet, *dns1);  // 8888 sau 1111 sau 0000 sau gateway- dns pt a interoga time corect
        WiFi.begin(ssid, password);
        uint8_t too_much = 0;
        while (WiFi.status() != WL_CONNECTED && too_much < 16) { //8 sec 
            digitalWrite(LED_BUILTIN, LOW); // led on
            delay(250);
            digitalWrite(LED_BUILTIN, HIGH); // led off
            delay(250);
            too_much++;
        }
        if (WiFi.status() == WL_CONNECTED) {
            if (isMobile)
                webpage = hotspot_page;
            else
                webpage = webpage_router;
            return 1;
        }
        else 
            return 0;
    }
    const char* getSsid() {
        return ssid;
    }
};

Router* router[] = {    //Router( _ssid,   _password, * _ip, * _gateway, * _subnet, *_ddns1, isMobile) 
    new  Router("",               "",    new IPAddress(192, 168, 0, 59),  new IPAddress(192, 168, 0, 1),  new IPAddress(255, 255, 255, 0), new IPAddress(8, 8, 8, 8), false),
    new  Router("Rotaru", "Rotaru2022",   new IPAddress(192, 168, 43, 43), new IPAddress(192, 168, 43, 1), new IPAddress(255, 255, 255, 0), new IPAddress(192, 168, 43, 1), true), //mobile
};



void setup() {
    pinMode(LED_BUILTIN, OUTPUT);
    digitalWrite(LED_BUILTIN, HIGH); //led off 
    EEPROM.begin(512); //initializare EEPROM
    delay(100);
    read_eeprom(); // => esid si epass si daca e hotspot mobil
    if (emobile) 
        router[0] = new  Router(esid.c_str(), epass.c_str(), new IPAddress(192, 168, 43, 43), new IPAddress(192, 168, 43, 1), new IPAddress(255, 255, 255, 0), new IPAddress(192, 168, 43, 1), true);
    else 
        router[0] = new  Router(esid.c_str(), epass.c_str(), new IPAddress(192, 168, 0, 59), new IPAddress(192, 168, 0, 1), new IPAddress(255, 255, 255, 0), new IPAddress(8, 8, 8, 8), false);

    WiFi.mode(WIFI_STA);
    uint8_t index_r = 0;
    while (WiFi.status() != WL_CONNECTED) {
        if (index_r == sizeof(router) / sizeof(Router*) ) {
            hai_eeprom();  //nu s-a conectat deci porneste ap
        }
        for (index_r = 0; index_r < sizeof(router) / sizeof(Router*); index_r++) {
            if (strlen(router[index_r]->getSsid()) > 0) {
                if (router[index_r]->gogogo()) {
                    break;
                }
            }
        }
    }
    Serial.begin(9600);  // pornesc abia acum dup[ conectare conexiunea seriala pt ca pana acum am folosit tx(GPOI1) pentru a controla ledul albastru
    
    timeClient.setTimeOffset(10800);
    timeClient.begin();
    timeClient.update();
    server.begin();      // pornire server ... daca a ajuns aici inseamna ca s-a conectat
}

void read_eeprom() {
    for (uint8_t i = 0; i < 32; ++i) 
        esid += char(EEPROM.read(i)); //citest nume din eeprom char-by-char
    for (uint8_t i = 32; i < 95; ++i) 
        epass += char(EEPROM.read(i));
    emobile = char(EEPROM.read(95));
}

void hai_eeprom() {                                 // incepe procedura de memorare a unei retele wifi fara hard coding, cu ajutorul memoriei eeprom a modulului
    WiFi.mode(WIFI_AP);                             // trec modulul in modul AccessPoint  ca sa ma pot conecta la EL prin wifi. actioneaza ca un router.
    server1.on("/", []() {                          // pagina principala fara sufix a gateway-ului  modulului
        int n = WiFi.scanNetworks();                // caut retele wireless chir daca sunt ]n modul router ap, mai exact    n = nr retele disponibile
        content = " <!DOCTYPE HTML>\r\n <html>   <head>  <meta name=\"viewport\" content=\"width=device-width, initial-scale=1\"> <link rel=\"icon\" href=\"data:,\"> \r\n";
        content += "<style> html{font-family:Helvetica;display:inline-block;margin:0px auto;text-align:center;font-size 22px;}  ";
        content += "input{border-radius:15px;} input[type=checkbox]{transform: scale(1.5);} button{border-radius:15px;height:40px;background-color:ivory;}</style><title>Rotaru Ioan - Licen&#355;&#259;</title></head>\r\n";
        content += " <body style=background-color:#ff9955;> \r\n <h4>Conectarea modulului Wi-Fi la internet</h4> <hr> <form method='post' action='ssid_pass_mob'> \r\n";
        content += "<p>SSID:  <SELECT style=border-radius:15px;height:40px;text-align-last:center;background-color:ivory; name='ssid'> \r\n";
        content += "<OPTION selected=yes  disabled selected> Selecteaz&#259; numele re&#355;elei... </option> \r\n";
        for (int i = 0; i < n; i++)           
            content += "<OPTION VALUE=" + WiFi.SSID(i) + ">" + WiFi.SSID(i) + "</OPTION> \r\n";                // adaug in lista toate retelele wi-fi disponibile pe care le vede modulul
        content += "</SELECT> </p>";  //se termina par cu label_ssid + lista
        content += " <p> PASS: <input  style=width:120px;height:35px;background-color:ivory; type='password' name='pass' placeholder='parola wifi...'> </p> \r\n";  
        content += "<p> Hotspot mobil  <input  type='checkbox' name='mobile' value=\"1\"> </p>  \r\n";
        content += " <p> <input type='submit' style=height:40px;background-color:ivory; value = \"Conectare\"> </p> </form> <hr> \r\n";
        content += "<p> <a href='/'> <button type='button' >Scaneaza din nou...</button> </a> </p> ";
        content += "</body></html>";                 // content a primit continutul paginii gateway
        server1.send(200, "text/html", content);    //trimit pagina compusa mai devreme la statia conectata ( telefon conectat la ap de ex )
    });

    server1.on("/ssid_pass_mob", []() {                 //gestionez ce se intampla daca sta'ia conectata (tel) a dat submit la niste credidentials
        String qsid = server1.arg("ssid");
        String qpass = server1.arg("pass");         // salvez argumentele trimie prin submit: ssid, parola, flag daca reteaua e hotspot mobil
        uint8_t qmobile = server1.arg("mobile").toInt();  
        bool trywifi = false;                       // flag daca incerc sa ma conectez la reteaua trimisa prin submit, intai o verific
        if (qsid.length() > 0) {                    //
            trywifi = true;
            for (int i = 0; i < 96; ++i) 
                EEPROM.write(i, 0);             //stergere eeprom 
            for (int i = 0; i < qsid.length(); ++i) 
                EEPROM.write(i, qsid[i]);       //scriere in eeprom caracter cu caracter
            for (int i = 0; i < qpass.length(); ++i) 
                EEPROM.write(32 + i, qpass[i]); //scriere in eeprom caracter cu caracter
            EEPROM.write(95, qmobile);
            EEPROM.commit();
            content = "<!DOCTYPE HTML>\r\n<html><body style=background-color:#ff9955;> <h3>Modulul se conecteaz&#259; la re&#355;eaua selectat&#259; . . . </h3><hr></body</html>";
        }
        else 
            content = "<!DOCTYPE HTML>\r\n<html><body style=background-color:#ff9955;> <h3>Incearc&#259; din nou...</h3><hr></body</html>";
        server1.send(200, "text/html", content);
        delay(1000); //se reseta f[r[ s[ afi;ese pag
        if (trywifi) 
            ESP.reset();
    });

    server1.begin();
    WiFi.softAP("LICENTA_ROTARU", "licenta22"); //ssid: LICENTA_Rotaru / L_R   pass: licenta22
    digitalWrite(LED_BUILTIN, LOW);   // led ON during AP ON
    while (1) {
        server1.handleClient(); // e atent daca se conecteaza cineva ap
    }

