armandioan/Licenta2022/Cod_sursă_ESP8266.cpp
}
///////////////////////////




void loop() {
    if (Serial.available() > 0) {           // daca uC a trimis ceva (bloc standard) 
        fromQFP = Serial.readString();      // salvez ce a trimis 
        h_rooms[1] = fromQFP.substring(0, 2);
        h_rooms[2] = fromQFP.substring(2, 4);
        h_rooms[3] = fromQFP.substring(4, 6);
        s_temp_rooms[1] = fromQFP.substring(6, 10);
        s_temp_rooms[2] = fromQFP.substring(10, 14);
        s_temp_rooms[3] = fromQFP.substring(14, 18);
        heat_rooms[0] = fromQFP.substring(18, 19).toInt();
        heat_rooms[1] = fromQFP.substring(19, 20).toInt();
        heat_rooms[2] = fromQFP.substring(20, 21).toInt();
        heat_rooms[3] = fromQFP.substring(21, 22).toInt();
        window_rooms[1] = (fromQFP.substring(22, 23)).toInt();
        window_rooms[2] = (fromQFP.substring(23, 24)).toInt();
        window_rooms[3] = (fromQFP.substring(24, 25)).toInt();
        alarm_rooms[1] = (fromQFP.substring(25, 26)).toInt();
        alarm_rooms[2] = (fromQFP.substring(26, 27)).toInt();
        alarm_rooms[3] = (fromQFP.substring(27, 28)).toInt();
    }

    WiFiClient client = server.available();     //creez obiect de tip client 
    client.setTimeout(100);                     // ii setez timeout la 100ms ca nu dureaza mai mult sa trimit[ textul cu cererea
    if (client) {                               //daca am un client conectat
        currentTime = millis();                 //salvez timpul curent
        previousTime = currentTime;             //salvez timpul curent
        while (client.connected() && currentTime - previousTime <= timeoutTime) {     //cat timp am client conectat si nu sta conectat degeaba
            currentTime = millis();                                                   //gestionez cat timp am clientul conectat
            if (client.available()) {                                                 //daca clientul a trimis un req
                if (firstline) {                                                      //    daca e prima linie din req
                    header = client.readStringUntil('\n');                            //    salveaz-o pana la final
                    //Serial.println(header);////////////////////////////////////////////////////////
                    firstline = false;                                                //    reset flag de linia1 ( e importanta primalinie)
                }
                currentLine = client.readStringUntil('\r');                           //citec linie cu linie requestul clientului(am interes pt tot blocul)
                client.read();                                                        //trec peste caracterul newline ca sa nu il salvez in linia curenta
                if (currentLine.startsWith("User-Agent:")) {                          //(linia cu semnatura disp)
                    signature = currentLine.substring(12);                            //salvez temporar semnatura disp care a facut req
                    for (uint8_t k = 0; k <= NR_MAX_DISP; k++) {                      //caut sa vad daca cunosc disp ce a facut req
                        if (signatures[k] == signature) {                             //  daca cunosc dispozitivul
                            if (header.startsWith("GET /?room="))                     //    dac[ vrea s[ vad[ param dintr-o camer[
                                rooms[k] = (header.substring(11, 12)).toInt();        //      salveaz[ camera pe care o vrea
                            if (header.startsWith("GET /?tx=")) {                     //    daca vrea sa sch t in cam la care se uita
                                s_set_temp_rooms[rooms[k]] = header.substring(9, 13); //      salveaz[ t pe care o vrea in cam la care se uita
                                if (rooms[k] == 0) {                                  //      daca se uit[ la "toate camerele"
                                    global_temp = true;                               //        inseamna ca vrea sa schimbe t in toate camerele
                                    for (uint8_t i = 1; i <= 3; i++)                  //        parcurg camerele 1,2,3
                                        s_set_temp_rooms[i] = s_set_temp_rooms[0];    //          salvez t dorita pentru toate cam
                                }
                                else                                                  //      altfel daca se uita la o singura cam
                                    global_temp = false;                              //          seteaza flag de temp globala off 
                                send_temp = true;                                     //    seteaz[ flag ca sa trimita noile temp catre uC
                                cookie = true;                                        //    seteaz[ flag pt refresh web mai rapid ca sa se vada
                            }                                                                    // modificarile procesate de uC trimise inapoi

                            if (header.startsWith("GET /?M=")) {                       //    dac[ vrea s[ schimbe modul de incalzire
                                Mod_Incalzire = (header.substring(8, 9)).toInt();                 //      salveaz[ modul dorit
                                send_temp = true;                                       //      flag ca sa trimita modul catre uC
                            }                       /// ?T=1&T=0&N=20%3A00&D=06%3A00
                                                    //      ?T=0&N=20%3A00&D=06%3A00
                            if (header.startsWith("GET /?T=")) {                        //    dac[ vrea s[ schimbe modul noapte
                                send_temp = true;                                       //      trimite temp din nou la uC
                                if (header.substring(8, 9) == "1") {                   //      daca vrea sa il opreasca
                                    Mod_Noapte = true;
                                    oraStart = (header.substring(16, 18));
                                    minStart = (header.substring(21, 23));
                                    oraStop = (header.substring(26, 28));
                                    minStop = (header.substring(31, 33));
                                }
                                else {//daca e 0
                                    Mod_Noapte = false;
                                    oraStart = (header.substring(12, 14));
                                    minStart = (header.substring(17, 19));
                                    oraStop = (header.substring(22, 24));
                                    minStop = (header.substring(27, 29));
                                }
                                set_Status_Mod_Noapte();
                            }


                            SHOW(client, rooms[k], cookie);                           //  trimite pagina web clientului cu modificarile 
                            cookie = false;                                           //  reseteaz[ flag pt refresh rapid 
                            newd = false;                                             //  (flag)cunosc disp deci nu e un newDevice
                            if (send_temp) {                                          //  daca am flag de trimitere temp ON 
                                Serial.print(s_set_temp_rooms[1] + s_set_temp_rooms[2] + s_set_temp_rooms[3] + Mod_Incalzire + Status_Mod_Noapte);  // trimite temp la uC
                                send_temp = false;                                    //  setez flag off dupa ce le-am trimis
                            }
                            break;                                                    //  cunosc disp, nu mai caut altul cu aceeasi semnatura
                        }//daca cunosc disp
                    }//for: caut disp daca e autorizat
                }//linia cu semnatura
                if (currentLine.length() == 0) {                                      //daca linia la care am ajuns e goal[ inseamna ca sunt la finalul blocului de req
                    if (newd) {                                                       //  daca nu cunosc disp care a facut req
                        String post_data = client.readString();                       //    citesc linia de dupa linia goala ce poate contine o parola
                        //Serial.println(currentLine);////////////////////////////////////////////////////////
                        //Serial.println(post_data);////////////////////////////////////////////////////////
                        bool first_try = true;                                        //    consider ca a prima data cand baga parola
                        bool nokpass = false;                                         //    consider ca o introduce gresit (flag)
                        if (post_data.substring(0, 9) == "password=") {               //    daca disp incearc[ sa se autorizeze
                            if (post_data.substring(9) == PAROLA_MONTAJ) {             //        daca a introdus parola CORECT
                                signatures[nrdev] = signature;                        //            AUTORIZARE OK
                                first_try = false;                                        //            reset flag prima incercare
                                SHOW(client, rooms[nrdev], false);//////////////////////            trimit catre el pagina cu camerele
                                nrdev++;                                              //            incrementez nr disp cunoscute
                            }
                            else                                                      //        daca a introdus parola GRESIT
                                nokpass = true;                                       //            flag parola gresit[
                        }
                        if (first_try)                                                //    daca e prima daca c[nd acceseaza sau daca a gresit parola  
                            SHOW_PASS(client, nokpass);/////////////////////////////////        ii arat pagina de conectare (cu mesaj de parola gresita daca e cazul)
                    }
                    break;
                }
                //Serial.println(currentLine);//////////pt debug//////////////////////////////////////////////
            }
        }
        newd = true;
        firstline = true;
        client.stop();
    }
    
    if (Mod_Noapte) { //daca e bifat
        currentTime = millis();
        if (currentTime - Last_TIME > Check_TIME) {  //Odat[ la Check_TIME verific ceasul prin internet
            Last_TIME = currentTime;
            set_Status_Mod_Noapte();
            Serial.print(s_set_temp_rooms[1] + s_set_temp_rooms[2] + s_set_temp_rooms[3] + Mod_Incalzire + Status_Mod_Noapte);
        }
    }

