armandioan/Licenta2022/Cod_sursă_ESP8266.cpp
}

void SHOW(WiFiClient& client, uint8_t& room, bool  cookie) {
    client.println("HTTP/1.1 200 OK");
    client.println("Content-type:text/html");
    client.println("Connection: close");
    client.println();                                               // dupa header necesar pt browser trimit pag html
    client.println("<!DOCTYPE html><html>");
    client.println("<head><meta name='viewport' content='width=device-width, initial-scale=1'>");

    if (cookie)                                                     // flag refresh rapid
        client.println("<meta http-equiv=refresh content='7; url=" + webpage + "'/>");
    else 
        if(room)
            client.println("<meta http-equiv=refresh content='14; url=" + webpage + "'/>");

    client.println("<link rel=\"icon\" href=\"data:,\">");         //iconita pt browser
    client.println("<style>html{font-family:Helvetica;display inline-block;margin:0px auto;text-align:center;font-size:18px;}");
    client.println("table{margin-left:auto;margin-right:auto;border-spacing:5px 10px;} tr{height:35px;} th,td{border-radius:15px;}");
    client.println("tr:nth-child(even){background-color:rgba(255,255,255,0.05);} tr:nth-child(odd){background-color:rgba(255,255,255,0.2);}</style>");     
    client.println("<title>Rotaru Ioan - Licen&#355;&#259;</title> </head> <body style=background-color:#ff9955;> <h3> Control &#238;nc&#259;lzire</h3> <hr>");
    if (heat_rooms[0])
        client.println("<table><td style=background-color:GoldenRod;>Centrala termic&#259; este PORNIT&#258;</td> </table>");
    else 
        client.println("<table><td style=background-color:DarkTurquoise;>Centrala termic&#259; este OPRIT&#258;</td> </table>");

    client.print("<hr><form  method=get>  <p><b>Camera: &nbsp&nbsp </b> ");
    client.println("<SELECT onchange=this.form.submit() NAME=room style=width:140px;height:35px;background-color:ivory;border-radius:15px;text-align-last:center;>");
    for (uint8_t r = 0; r <= 3; r++) {
        client.print("<OPTION ");
        if (r == room) 
            client.print("selected=yes ");
        client.print("VALUE=");
        client.print(r);
        client.println(">" + name_rooms[r] + "</OPTION>");
    }
    client.println("</SELECT></p></form>");

    if (room > 0) {
        client.println("<p> Temperatura actual&#259;: <b>" + s_temp_rooms[room] + " &#8451; </b></p>");
        client.println("<form  method=get> <p><b>Temperatura dorit&#259;: &nbsp </b>");
        client.println("<SELECT onchange=this.form.submit() NAME=tx style=width:70px;height:35px;background-color:ivory;border-radius:15px;text-align-last:center;>");
        for (String iiii : temps) {
            client.print("<OPTION ");
            if (iiii == s_set_temp_rooms[room]) 
                client.print("selected=yes ");
            client.println("VALUE=" + iiii + ">" + iiii + "</OPTION>");
        }
        client.println("</SELECT> &#8451;</p></form>");

        client.println("<table><tr><td style=width:180px;>Umiditatea:</td><th style=width:120px;>" + h_rooms[room] + " % </th></tr>");
        (heat_rooms[room]) ? client.print("<tr><td>Robinet calorifer:</td><th style=background-color:GoldenRod;>Deschis</th></tr>") : client.print("<tr><td>Robinet calorifer:</td><th style=background-color:DarkTurquoise;>Inchis</th></tr>");
        (window_rooms[room]) ? client.println("<td>Starea Ferestrei:</td><th style=background-color:tomato;>Deschis&#259;</th></tr>") : client.println("<tr><td>Starea Ferestrei:</td><th>&#206;nchis&#259;</th></tr>");
        (alarm_rooms[room]) ? client.println("<tr><td>Alarm&#259; sonor&#259;:</td><th style=background-color:tomato;>Pornit&#259;</th></tr></table>") : client.println("<tr><td>Alarm&#259; sonor&#259;:</td><th>Oprit&#259;</th></tr></table>");
    }
    if (room == 0) {
        client.println("<table><tr><form method=get> <td>Seta&#355;i temperatura<br> in toate camerele: &nbsp </td>");
        client.println("<td><SELECT onchange=this.form.submit() NAME=tx style=width:px;height:35px;background-color:ivory;border-radius:15px;text-align-last:center;>");
        if (!global_temp) {
            client.print("<option value='' disabled selected>Setat&#259; particular...</option>");
            for (String iiii : temps)
                client.print("<OPTION VALUE=" + iiii + ">" + iiii + "</OPTION>");
        }
        else {
            for (String iiii : temps) {
                client.print("<OPTION ");
                if (iiii == s_set_temp_rooms[room])
                    client.print("selected=yes ");
                client.println("VALUE=" + iiii + ">" + iiii + "</OPTION>");
            }
        }
        if (!global_temp) 
            client.println("</SELECT></td></form></tr>");
        else
            client.println("</SELECT> &#8451;</td></form></tr>");

        client.print("<tr><form method=get><td>Mod noapte :<input style=width:20px;height:20px; type='checkbox' name='T' value='1'");
        if (Mod_Noapte)
            client.print(" checked");
        client.print("/><input type='hidden' name='T' value='0'/> <br> <input style=background-color:ivory;border-radius:15px;height:30px; type='submit' value='Salveaza'> </td>");
        client.print("<td align='right'><label>T<sub>Start</sub> =</label><input style=width:70px;height:30px; type='time' name='N' min='12:00' max='23:59' value='"); 
        client.print( oraStart + ":" + minStart ); // timp start
        client.print("'><br><label>T<sub>Stop</sub> =</label><input style=width:70px;height:30px; type='time' name='D' min='00:00' max='11:59', value='");
        client.print( oraStop + ":" + minStop ); //timp stop"
        client.print("'></td></form></tr>");

        client.println("<tr><form method=get><td>Mod &#206;nc&#259;lzire:</td><td align='left'>");
        client.println("<input style=width:20px;height:20px; onclick=this.form.submit() type='radio' id='normal' name='M' value='0'");
        if (Mod_Incalzire == 0)
            client.println(" checked ");
        client.println("> <label for='normal'>Mod Normal</label><br> <input style=width:20px;height:20px; onclick=this.form.submit() type='radio' id='confort' name='M' value='1'");
        if (Mod_Incalzire == 1)
            client.println(" checked ");
        client.println("> <label for='confort'>Mod Confort</label><br> <input style=width:20px;height:20px; onclick=this.form.submit() type='radio' id='eco' name='M' value='2'");
        if (Mod_Incalzire == 2)
            client.println(" checked ");
        client.println("> <label for='eco'>Mod Eco</label><br></td></form></tr>");

        if (heat_rooms[0]) {
            client.println("<tr> <td>&#206;nc&#226;lzirea func&#355;ioneaz&#259; &#238;n:</td> <th> <ul align='left'>");
            for (uint8_t i = 1; i <= 3; i++) {
                if (heat_rooms[i])
                    client.println("<li>" + name_rooms[i] + "</li>");
            }
            client.println("</ul></th></tr>");
        }
        client.println("</table>");
    }
    client.println("</body></html>");
    client.println();
}

void SHOW_PASS(WiFiClient& client, bool nok) {  // afisare pagina de autorizare 
    client.println("HTTP/1.1 200 OK");
    client.println("Content-type:text/html");
    client.println("Connection: close");
    client.println();       //dupa acest header necesar pt browser se trimite si pagina html
    client.println("<!DOCTYPE html><html>");
    client.println("<head><meta name='viewport' content='width=device-width,initial-scale=1'>");
    client.println("<link rel=\"icon\" href=\"data:,\">");
    client.println("<style>html{font-family:Helvetica;display:inline-block;margin:0px auto;text-align:center;font-size:22px;}");
    client.println("</style>");
    client.println("<title> Rotaru Ioan - Licenta </title>  ");
    client.println("</head>  <body style=background-color:#ff9955;><h2>Control Ambiental</h2><hr>");
    client.println("<form method=post><input type=password style=width:150px;border-radius:15px;height:35px; name='password' id='password' placeholder='Introduceti parola...'> ");
    client.println("<input type='submit' style=height:40px;background-color:ivory;border-radius:15px; value='Autorizare dispozitiv'> </form>");
    if (nok)     // flag daca noul disp a gresit parola afiseaza mesaj
        client.println("<p style=color:red;> Parola gresita :( </p>");
    client.println("<hr> <hr>  </body> </html>");
    client.println();
}


void set_Status_Mod_Noapte() {
    Status_Mod_Noapte = false;          //consider ca nu trebuie activat, dupa il activez daca se indeplinesc conditiile
    if (Mod_Noapte) {                   //daca modul noapte e activ, verific daca trebuie 
        timeClient.update();
        uint8_t HH = timeClient.getHours();   
        uint8_t MM = timeClient.getMinutes();
            //12:01-23:59 (Start->PM)    // 00:01 - 11:59 (Stop->AM)
        if ( HH >= 0  &&  HH <= 11 ) {           //daca e dimi 
            if ( HH < oraStop.toInt() )         //daca ora curenta e sub ora de stop inseamna ca pornesc modul noapte
                Status_Mod_Noapte = true;
            else 
                if ( HH == oraStop.toInt()   &&   MM <= minStop.toInt() )
                    Status_Mod_Noapte = true;
        }
        else 
            if (HH >= 12 && HH <= 23) {               //daca e seara 
                if (HH > oraStart.toInt() )           //daca ora curenta e peste ora de start inseamna ca pornesc modul noapte
                    Status_Mod_Noapte = true;
                else
                    if (HH == oraStart.toInt() && MM >= minStart.toInt() )
                        Status_Mod_Noapte = true;
            }
    }     
}
